In [2]:
import numpy as np
import pandas as pd

In [3]:
data= pd.read_csv("houserentdhaka.csv")

In [4]:
data[data['Location']=='Baridhara, Dhaka']

       Unnamed: 0          Location        Area  Bed  Bath        Price
4               4  Baridhara, Dhaka  2,200 sqft    3     3  75 Thousand
6               6  Baridhara, Dhaka  2,300 sqft    3     3  75 Thousand
30             30  Baridhara, Dhaka  1,524 sqft    3     3       1 Lakh
105           105  Baridhara, Dhaka  1,524 sqft    3     3       1 Lakh
154           154  Baridhara, Dhaka  4,200 sqft    4     4       4 Lakh
...           ...               ...         ...  ...   ...          ...
27621        3621  Baridhara, Dhaka  2,500 sqft    3     3     1.5 Lakh
27850        3850  Baridhara, Dhaka  2,300 sqft    3     3  80 Thousand
28137        4137  Baridhara, Dhaka  3,750 sqft    4     4       3 Lakh
28488        4488  Baridhara, Dhaka  2,250 sqft    3     3  60 Thousand
28636        4636  Baridhara, Dhaka  2,400 sqft    3     4  65 Thousand

[106 rows x 6 columns]

In [5]:
data.head()

,Unnamed: 0,Location,Area,Bed,Bath,Price
0,0,"Block H, Bashundhara R-A, Dhaka","1,600 sqft",3,3,20 Thousand
1,1,"Farmgate, Tejgaon, Dhaka",900 sqft,2,2,20 Thousand
2,2,"Block B, Nobodoy Housing Society, Mohammadpur,...","1,250 sqft",3,3,18 Thousand
3,3,"Gulshan 1, Gulshan, Dhaka","2,200 sqft",3,4,75 Thousand
4,4,"Baridhara, Dhaka","2,200 sqft",3,3,75 Thousand

In [6]:
data= data.drop(columns=["Unnamed: 0"])

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28800 entries, 0 to 28799
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  28800 non-null  object
 1   Area      28800 non-null  object
 2   Bed       28800 non-null  int64
 3   Bath      28800 non-null  int64
 4   Price     28800 non-null  object
dtypes: int64(2), object(3)
memory usage: 1.1+ MB

In [8]:
for i in data.columns:
    print(data[i].value_counts())
    print('-----------')

Location
Mohammadpur, Dhaka                                 757
Mirpur, Dhaka                                      556
Block D, Section 12, Mirpur, Dhaka                 417
Dhanmondi, Dhaka                                   414
Block E, Section 12, Mirpur, Dhaka                 411
                                                  ...
Tilpapara Road, Tilpapara, Khilgaon, Dhaka           1
Old Elephant Road, Maghbazar, Dhaka                  1
Road No 16, Banani, Dhaka                            1
South Kutubkhali, Kutubkhali, Jatra Bari, Dhaka      1
Majed Sardar Road, Bangshal, Dhaka                   1
Name: count, Length: 730, dtype: int64
-----------
Area
650 sqft      3042
700 sqft      2810
800 sqft      2396
1,200 sqft    1591
750 sqft      1394
              ...
1,082 sqft       1
835 sqft         1
1,674 sqft       1
845 sqft         1
2,190 sqft       1
Name: count, Length: 596, dtype: int64
-----------
Bed
2    14277
3    12972
4     1064
1      461
5       24
6        2
Name: count, dtype: int64
-----------
Bath
2    15768
3     8468
1     2369
4     2048
5      139
6        7
8        1
Name: count, dtype: int64
-----------
Price
15 Thousand       2679
12 Thousand       2056
20 Thousand       2019
16 Thousand       1947
14 Thousand       1875
                  ...
13.7 Thousand        1
29.9 Thousand        1
79 Thousand          1
16.18 Thousand       1
47.5 Thousand        1
Name: count, Length: 223, dtype: int64
-----------

In [9]:
data['Location'].value_counts()

Location
Mohammadpur, Dhaka                                 757
Mirpur, Dhaka                                      556
Block D, Section 12, Mirpur, Dhaka                 417
Dhanmondi, Dhaka                                   414
Block E, Section 12, Mirpur, Dhaka                 411
                                                  ...
Tilpapara Road, Tilpapara, Khilgaon, Dhaka           1
Old Elephant Road, Maghbazar, Dhaka                  1
Road No 16, Banani, Dhaka                            1
South Kutubkhali, Kutubkhali, Jatra Bari, Dhaka      1
Majed Sardar Road, Bangshal, Dhaka                   1
Name: count, Length: 730, dtype: int64

In [10]:
data.isna().sum()

Location    0
Area        0
Bed         0
Bath        0
Price       0
dtype: int64

In [11]:
from word2number import w2n
def str2int(number):
    temp= number.split(' ')
    temp[0]= temp[0].replace(',','')
    return float(temp[0])

In [12]:
data['Price']= data['Price'].apply(str2int)

In [13]:
data['Price']= data['Price'].apply(lambda x:int(x*1000*360))
data['Price']

0         7200000
1         7200000
2         6480000
3        27000000
4        27000000
           ...
28795     5400000
28796     9000000
28797     8280000
28798    10800000
28799     5400000
Name: Price, Length: 28800, dtype: int64

In [14]:
data['Area']= data['Area'].apply(str2int)

In [15]:
data['Area']= data['Area'].apply(int)

In [16]:
location_count= data['Location'].value_counts()
location_count

Location
Mohammadpur, Dhaka                                 757
Mirpur, Dhaka                                      556
Block D, Section 12, Mirpur, Dhaka                 417
Dhanmondi, Dhaka                                   414
Block E, Section 12, Mirpur, Dhaka                 411
                                                  ...
Tilpapara Road, Tilpapara, Khilgaon, Dhaka           1
Old Elephant Road, Maghbazar, Dhaka                  1
Road No 16, Banani, Dhaka                            1
South Kutubkhali, Kutubkhali, Jatra Bari, Dhaka      1
Majed Sardar Road, Bangshal, Dhaka                   1
Name: count, Length: 730, dtype: int64

In [17]:
location10= location_count[location_count<=10]

In [18]:
data['Location']= data['Location'].apply(lambda x:'Other' if x in location10 else x)

In [19]:
data['Location'].value_counts()

Location
Other                                                1232
Mohammadpur, Dhaka                                    757
Mirpur, Dhaka                                         556
Block D, Section 12, Mirpur, Dhaka                    417
Dhanmondi, Dhaka                                      414
                                                     ...
Block C, Future Town, Bochila, Mohammadpur, Dhaka      11
South Manikdi, Manikdi, Cantonment, Dhaka              11
Chalabon, Dakshin Khan, Dhaka                          11
Avenue 10, Mirpur DOHS, Mirpur, Dhaka                  11
Lalkuthi, 3rd Colony, Mirpur, Dhaka                    11
Name: count, Length: 418, dtype: int64

In [20]:
data.describe()

               Area           Bed          Bath         Price
count  28800.000000  28800.000000  28800.000000  2.880000e+04
mean    1057.332049      2.511076      2.369653  6.826727e+06
std      477.821030      0.601353      0.756758  3.861108e+06
min      200.000000      1.000000      1.000000  3.600000e+05
25%      700.000000      2.000000      2.000000  4.680000e+06
50%      900.000000      2.000000      2.000000  5.760000e+06
75%     1250.000000      3.000000      3.000000  7.560000e+06
max     6300.000000      6.000000      8.000000  3.420000e+07

In [21]:
data= data[(data['Area']/data['Bed'])>=300]
data.describe()

               Area           Bed          Bath         Price
count  27876.000000  27876.000000  27876.000000  2.787600e+04
mean    1071.620498      2.514385      2.398479  6.899814e+06
std      478.252799      0.603584      0.745538  3.897164e+06
min      300.000000      1.000000      1.000000  3.600000e+05
25%      700.000000      2.000000      2.000000  4.680000e+06
50%      950.000000      2.000000      2.000000  5.760000e+06
75%     1250.000000      3.000000      3.000000  7.920000e+06
max     6300.000000      6.000000      8.000000  3.420000e+07

In [22]:
data['pps']= data['Price']/data['Area']
data.pps.describe()

count    27876.000000
mean      6569.400100
std       1832.333744
min         90.000000
25%       5538.461538
50%       6400.000000
75%       7500.000000
max      25434.782609
Name: pps, dtype: float64

In [23]:
data.head()

,Location,Area,Bed,Bath,Price,pps
0,"Block H, Bashundhara R-A, Dhaka",1600,3,3,7200000,4500.000000
1,"Farmgate, Tejgaon, Dhaka",900,2,2,7200000,8000.000000
2,"Block B, Nobodoy Housing Society, Mohammadpur,...",1250,3,3,6480000,5184.000000
3,"Gulshan 1, Gulshan, Dhaka",2200,3,4,27000000,12272.727273
4,"Baridhara, Dhaka",2200,3,3,27000000,12272.727273

In [24]:
def outlier_area(df):
    df_out= pd.DataFrame()
    for key,subdf in df.groupby('Location'):
        m= np.mean(subdf.pps)
        st= np.std(subdf.pps)
        gen_df= subdf[(subdf.pps>m-st) & (subdf.pps<=m+st)]
        df_out= pd.concat([df_out,gen_df],ignore_index=True)
    return df_out
data= outlier_area(data)
data.describe()

               Area           Bed          Bath         Price           pps
count  19844.000000  19844.000000  19844.000000  1.984400e+04  19844.000000
mean    1072.346503      2.519704      2.410401  6.797639e+06   6470.192795
std      482.112973      0.594762      0.739035  3.534724e+06   1521.150493
min      400.000000      1.000000      1.000000  3.600000e+05    102.857143
25%      700.000000      2.000000      2.000000  4.680000e+06   5600.000000
50%      950.000000      2.000000      2.000000  5.760000e+06   6400.000000
75%     1250.000000      3.000000      3.000000  7.920000e+06   7200.000000
max     6300.000000      6.000000      8.000000  3.240000e+07  14142.857143

In [25]:
def outlier_bed(df):
    exc_ind= np.array([])
    for loc,loc_df in df.groupby('Location'):
        bed_stat={}
        for bed,bed_df in loc_df.groupby('Bed'):
            bed_stat[bed]={
                'mean': np.mean(bed_df.pps),
                'std': np.std(bed_df.pps),
                'count': bed_df.shape[0]
            }
        for bed,bed_df in loc_df.groupby('Bed'):
            stats= bed_stat.get(bed-1)
            if stats and stats['count']>5:
                exc_ind= np.append(exc_ind,bed_df[bed_df.pps<(stats['mean'])].index.values)
    return df.drop(exc_ind,axis= 'index')

In [26]:
data= outlier_bed(data)
data.shape

(14027, 6)

In [27]:
data.describe()

               Area           Bed          Bath         Price           pps
count  14027.000000  14027.000000  14027.000000  1.402700e+04  14027.000000
mean     988.696656      2.365296      2.282669  6.550217e+06   6643.477728
std      429.127779      0.560615      0.700584  3.619260e+06   1510.633982
min      400.000000      1.000000      1.000000  3.600000e+05    112.500000
25%      700.000000      2.000000      2.000000  4.320000e+06   5760.000000
50%      800.000000      2.000000      2.000000  5.400000e+06   6600.000000
75%     1150.000000      3.000000      3.000000  7.200000e+06   7500.000000
max     4500.000000      6.000000      6.000000  3.240000e+07  14142.857143

In [28]:
data.drop(columns=['pps'],inplace= True)

In [29]:
data.head()

                    Location  Area  Bed  Bath    Price
0  1st Colony, Mirpur, Dhaka   800    2     2  4860000
1  1st Colony, Mirpur, Dhaka   700    2     2  4320000
2  1st Colony, Mirpur, Dhaka  1100    3     3  7200000
3  1st Colony, Mirpur, Dhaka  1100    3     3  7200000
5  1st Colony, Mirpur, Dhaka   700    2     2  4320000

In [30]:
for i in ['Bed','Bath','Area']:
  data[i]= data[i].apply(float)

In [32]:
data.sort_values(by='Location')

                               Location    Area  Bed  Bath    Price
0             1st Colony, Mirpur, Dhaka   800.0  2.0   2.0  4860000
18            1st Colony, Mirpur, Dhaka  1120.0  3.0   3.0  7200000
17            1st Colony, Mirpur, Dhaka   950.0  2.0   2.0  5040000
11            1st Colony, Mirpur, Dhaka   650.0  2.0   2.0  3960000
9             1st Colony, Mirpur, Dhaka   700.0  2.0   2.0  4320000
...                                 ...     ...  ...   ...      ...
19820  aziz Moholla, Mohammadpur, Dhaka   720.0  2.0   2.0  5580000
19821  aziz Moholla, Mohammadpur, Dhaka   720.0  2.0   2.0  5400000
19823  aziz Moholla, Mohammadpur, Dhaka   720.0  2.0   2.0  5580000
19816  aziz Moholla, Mohammadpur, Dhaka   720.0  2.0   2.0  5580000
19843  aziz Moholla, Mohammadpur, Dhaka   720.0  2.0   2.0  5040000

[14027 rows x 5 columns]

In [34]:

data.to_csv('cleaned_data.csv')

In [31]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import  make_pipeline
from sklearn.metrics import r2_score

In [32]:
X= data.drop(columns=['Price'])
y= data['Price']

In [33]:
X_train,X_test, y_train,y_test= train_test_split(X,y, test_size= 0.2, random_state=0)
X_train.shape

(11221, 4)

In [34]:
y_test

95        5400000
9926      4680000
14073     7200000
3270     14400000
10017     6480000
           ...
4337      4680000
14189     4680000
18976     4680000
5763      4320000
499      16200000
Name: Price, Length: 2806, dtype: int64

In [35]:
column_trans= make_column_transformer((OneHotEncoder(sparse= False), ['Location']), remainder= 'passthrough')

In [36]:
scaler= StandardScaler()

In [37]:
lr= LinearRegression()

In [38]:
pipe= make_pipeline(column_trans,scaler,lr)

In [39]:
pipe.fit(X_train,y_train)
y_pred_lr= pipe.predict(X_test)
r2_score(y_test,y_pred_lr)

c:\Users\tanim\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

0.9169911558315609

In [40]:
# lasso= Lasso()
# pipe= make_pipeline(column_trans,scaler,lasso)
# pipe.fit(X_train,y_train)

In [41]:
y_pred_lasso= pipe.predict(X_test)
r2_score(y_test, y_pred_lasso)

0.9169911558315609

In [42]:
ridge= Ridge()
pipe= make_pipeline(column_trans, scaler, ridge)

In [43]:
pipe.fit(X_train,y_train)

c:\Users\tanim\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['Location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [44]:
y_pred_ridge= pipe.predict(X_test)
r2_score(y_test,y_pred_ridge)

0.9169767074371012

In [45]:
import pickle
pickle.dump(pipe,open('ridgemodel.pkl','wb'))